
Pi = str(3.1415926535)
num = int(input('введите число знаков после запятой '))
Pi = Pi[0:num+2]
print(Pi)

# Пользователь вводит число, Вам необходимо вывести число Пи с той точностью знаков после запятой, 
# сколько указал пользователь(БЕЗ ИСПОЛЬЗОВАНИЯ МОДУЛЕЙ/БИБЛИОТЕК)

