
# numbers = [int(i) for i in input('Введите номера через запятую ').split(',')]
# lst = set(numbers)
# print(lst)



# Задайте последовательность чисел. 
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
# 3 1 2 3
# 2 1


# numbers = [int(i) for i in input('Введите номера через запятую ').split(',')]
# print(numbers)
# unique = []
# for i in numbers:
#     if numbers.count(i) <2:
#         unique.append(i)
# print(unique)
