
# lst = [int(i) for i in input('Please input several lst deviding by space ').split(' ')]
# max = lst[0]
# min = lst[0]

# for i in lst:
#     if i > max:
#         max = i 
#     if i < min:
#         min = i

# print(min, max)

lst = [int(i) for i in input('Please input several lst deviding by space ').split(' ')]
print (f"Максимально число {max (lst)}")
print (f"Минимально число {min (lst)}")

# 1. Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число. 
# В качестве символа-разделителя используйте пробел.



