
a = 2
b = 6
maxN = 0
c = a*b
if a > maxN:
    maxN = a
if b>maxN:
    maxN = b


if maxN%a==0 and maxN%b==0:
    print(maxN)
elif c%a==0 and c%b==0:
    print(c)


def find nok(num1, num2) :
for i in range (max (num1, num2), num1 * num2 + 1) if i % numi == 0 and i % num2 == 0:
return
i
return None
num1, num2 = [int(i) for i in input ("Введитечисла: ').split( l
print (f' Наименьшее общее кратное
{find nok (num1, num2) }')

# 3. Задайте два числа. Напишите программу, которая найдёт НОК (наименьшее общее кратное) этих двух чисел.
